Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/fedora-tm.tmx
Source language: en
Languages: ca_es

source: This manual page describes the configuration of the IPA provider for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. For a detailed syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
ca_es: Aquesta pàgina del manual descriu la configuració del proveïdor IPA per <citerefentry><refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. Per una referència detallada sintaxi, aneu a la secció de <quote>FORMAT DE FITXER</quote> de la pàgina del manual <citerefentry>d'<refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry>.

source: The IPA provider is a back end used to connect to an IPA server. (Refer to the freeipa.org web site for information about IPA servers.) This provider requires that the machine be joined to the IPA domain; configuration is almost entirely self-discovered and obtained directly from the server.
ca_es: El proveïdor d'IPA és un back-end utilitzat per connectar a un servidor d'IPA. (Consuleteu el lloc web freeipa.org per obtenir informació sobre servidors IPA). Aquest proveïdor requereix afegir la màquina al domini d'IPA; la configuració s'auto-detecta gairebé totalment i s'obté directament des del servidor.

source: ipa_domain (string)
ca_es: ipa_domain (cadena)

source: Specifies the name of the IPA domain. This is optional. If not provided, the configuration domain name is used.
ca_es: Especifica el nom del domini IPA. Això és opcional. Si no s'especifica s'utilitza el nom de domini de la configuració.

source: ipa_hostname (string)
ca_es: ipa_hostname (cadeba)

source: Optional. May be set on machines where the hostname(5) does not reflect the fully qualified name used in the IPA domain to identify this host.
ca_es: Opcional. Es pot definir en màquines on el hostname(5) no reflecteix el nom complet utilitzat en el domini d'IPA per identificar aquest amfitrió.

source: Default: Use the IP address of the IPA LDAP connection
ca_es: Per defecte: Utilitzar l'adreça IP de la connexió LDAP d'IPA

source: Default: the value of <emphasis>ldap_search_base</emphasis>
ca_es: Per defecte: el valor de <emphasis>ldap_search_base</emphasis>

source: krb5_validate (boolean)
ca_es: krb5_validate (booleà)

source: Verify with the help of krb5_keytab that the TGT obtained has not been spoofed.
ca_es: Comproveu amb l'ajuda de krb5_keytab que la TGT obtinguda no ha sigut suplantada.

source: Note that this default differs from the traditional Kerberos provider back end.
ca_es: Tingueu en compte que aquesta opció per defecte difereix del tradicional proveïdor Kerberos.

source: The following example assumes that SSSD is correctly configured and example.com is one of the domains in the <replaceable>[sssd]</replaceable> section. This examples shows only the ipa provider-specific options.
ca_es: L'exemple següent pressuposa que l'SSD està configurat correctament i example.com és un dels dominis de la secció <replaceable>[sssd]</replaceable>. Aquest exemple mostra només opcions específiques del proveïdor IPA.

source: System Security Services Daemon
ca_es: Dimoni de Serveis de Seguretat de Sistema

source: <command>SSSD</command> provides a set of daemons to manage access to remote directories and authentication mechanisms. It provides an NSS and PAM interface toward the system and a pluggable backend system to connect to multiple different account sources as well as D-Bus interface. It is also the basis to provide client auditing and policy services for projects like FreeIPA. It provides a more robust database to store local users as well as extended user data.
ca_es: L'<command>SSSD</command> proporciona un conjunt de dimonis per gestionar l'accés a directoris remots i mecanismes d'autenticació. Proporciona una interfície NSS i PAM cap el sistema i un mètode d'afegitons per connectar a múltiples fonts de comptes diferents així com a l'interfície D-Bus. També és la base per proporcionar auditació de clients i polítiques de serveis per a projectes com FreeIPA. Proporciona una base de dades més robusta on emmagatzemar usuaris locals, així com dades addicionals d'usuari.

source: <option>-d</option>,<option>--debug-level</option> <replaceable>LEVEL</replaceable>
ca_es: <option>-d</option>,<option>--debug-level</option> <replaceable>NIVELL</replaceable>

source: Send the debug output to files instead of stderr. By default, the log files are stored in <filename>/var/log/sssd</filename> and there are separate log files for every SSSD service and domain.
ca_es: Envia la sortida de depuració a fitxers en comptes d'stderr. Per defecte els fitxers de registre s'emmagatzemen a <filename>/var/log/sssd</filename> i hi ha fitxers de registre separats per a cada servei d'SSSD i domini.

source: Become a daemon after starting up.
ca_es: Esdevé un dimoni després d'iniciar-se.

source: Run in the foreground, don't become a daemon.
ca_es: Executa en primer pla, no esdevenir un dimoni.

source: Specify a non-default config file. The default is <filename>/etc/sssd/sssd.conf</filename>. For reference on the config file syntax and options, consult the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
ca_es: Especifi un fitxer de configuració direfent al per defecte. Per defecte és <filename>/etc/sssd/sssd.conf</filename>. Per consultar a la sintaxi del fitxer de configuració i les opcions, aneu a la pàgina del manual <citerefentry>d'<refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry>.

source: Signals
ca_es: Senyals

source: Informs the SSSD to gracefully terminate all of its child processes and then shut down the monitor.
ca_es: Informa l'SSSD per finalitzar elegantment tots els seus processos fil i llavors apagar el monitor.

source: Tells the SSSD to stop writing to its current debug file descriptors and to close and reopen them. This is meant to facilitate log rolling with programs like logrotate.
ca_es: Diu a l'SSSD que deixi d'escriure als actual descriptors de fitxers de depuració i que els tanqui i els reobri. Això intenta facilitar la rotació dels registres amb programes com logrotate.

source: Tells the SSSD to simulate offline operation for one minute. This is mostly useful for testing purposes.
ca_es: Demana a l'SSSD d'operar de manera simulada fora de línia durant un minut. Això principalment és útil per a propòsits de comprovacions.

source: Tells the SSSD to go online immediately. This is mostly useful for testing purposes.
ca_es: Demana a l'SSSD d'anar immediatament en línia. Això és útil principalment per a propòsits de comprovacions.

source: obfuscate a clear text password
ca_es: ofusca una contrasenya de text clar

source: <command>sss_obfuscate</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'><replaceable>[PASSWORD]</replaceable></arg>
ca_es: <command>sss_obfuscate</command> <arg choice='opt'> <replaceable>opcions</replaceable> </arg> <arg choice='plain'><replaceable>[PASSWORD]</replaceable></arg>

source: <command>sss_obfuscate</command> converts a given password into human-unreadable format and places it into appropriate domain section of the SSSD config file.
ca_es: <command>sss_obfuscate</command> converteix una contrasenya especificada en un format illegible per humans i la col·loca a la secció de domini adequada de l'arxiu de configuració d'SSSD.

source: Please note that obfuscating the password provides <emphasis>no real security benefit</emphasis> as it is still possible for an attacker to reverse-engineer the password back. Using better authentication mechanisms such as client side certificates or GSSAPI is <emphasis>strongly</emphasis> advised.
ca_es: Si us plau fixi's que ofuscar contrasenyes <emphasis>no proporciona cap benefici real de seguretat</emphasis> ja que un atacant encara podria extreure la contrasenya amb enginyeria inversa. Es recomana <emphasis>aferrissadament</emphasis> l'ús de mecanismes d'autenticació millors com certificats de client o GSSAPI.

source: The password to obfuscate will be read from standard input.
ca_es: La contrasenya per ofuscar es llegirà de l'entrada estàndard.

source: <option>-d</option>,<option>--domain</option> <replaceable>DOMAIN</replaceable>
ca_es: <option>-d</option>,<option>--domain</option> <replaceable>DOMINI</replaceable>

source: The SSSD domain to use the password in. The default name is <quote>default</quote>.
ca_es: El domini SSSD on utilitzar la contrasenya. El nom per defecte és <quote>default</quote>.

source: <option>-f</option>,<option>--file</option> <replaceable>FILE</replaceable>
ca_es: <option>-f</option>,<option>--file</option> <replaceable>FITXER</replaceable>

source: Read the config file specified by the positional parameter.
ca_es: Llegeix el fitxer de configuració especificat pel paràmetre de posició.

source: Default: <filename>/etc/sssd/sssd.conf</filename>
ca_es: Per defecte: <filename>/etc/sssd/sssd.conf</filename>

source: create a new user
ca_es: crea un usuari nou

source: <command>sss_useradd</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'><replaceable>LOGIN</replaceable></arg>
ca_es: <command>sss_useradd</command> <arg choice='opt'> <replaceable>OPCIONS</replaceable></arg> <arg choice='plain'> <replaceable>INICI DE SESSIÓ</replaceable></arg>

source: <command>sss_useradd</command> creates a new user account using the values specified on the command line plus the default values from the system.
ca_es: <command>sss_useradd</command> crea un nou compte d'usuari utilitzant els valors especificats a la línia d'ordres més els valors per defecte del sistema.

source: Set the UID of the user to the value of <replaceable>UID</replaceable>. If not given, it is chosen automatically.
ca_es: Especifica l'UID de l'usuari al valor d'<replaceable>UID</replaceable>. Si no es dóna, és seleccionat automàticament.

source: <option>-c</option>,<option>--gecos</option> <replaceable>COMMENT</replaceable>
ca_es: <option>-c</option>,<option>--gecos</option> <replaceable>COMMENTARI</replaceable>

source: Any text string describing the user. Often used as the field for the user's full name.
ca_es: Qualsevol cadena de text que descriu a l'usuari. Sovint s'utilitza com el camp pel nom i cognoms de l'usuari.

source: The home directory of the user account. The default is to append the <replaceable>LOGIN</replaceable> name to <filename>/home</filename> and use that as the home directory. The base that is prepended before <replaceable>LOGIN</replaceable> is tunable with <quote>user_defaults/baseDirectory</quote> setting in sssd.conf.
ca_es: El directori personal del compte d'usuari. Per defecte s'afegeix el <replaceable>NOM D'USUARI</replaceable> a <filename>/ home</filename> i s'utilitza allò com el directori personal. La base que s'afegeix abans del <replaceable>NOM D'USUARI</replaceable> és personalitzable amb el paràmetre <quote>user_defaults/baseDirectory</quote> de l'sssd.conf.

source: <option>-s</option>,<option>--shell</option> <replaceable>SHELL</replaceable>
ca_es: <option>-s</option>,<option>--shell</option> <replaceable>INTÈRPRET D'ORDRES</replaceable>

source: The user's login shell. The default is currently <filename>/bin/bash</filename>. The default can be changed with <quote>user_defaults/defaultShell</quote> setting in sssd.conf.
ca_es: L'intèrpret d'ordres de l'usuari. Per defecte és <filename>/bin/bash</filename>. Es pot canviar el valor per defecte amb el paràmetre <quote>user_defaults/defaultShell</quote> de l'sssd.conf.

source: <option>-G</option>,<option>--groups</option> <replaceable>GROUPS</replaceable>
ca_es: <option>-G</option>,<option>--groups</option> <replaceable>GRUPS</replaceable>

source: A list of existing groups this user is also a member of.
ca_es: Una llista dels grups existents on n'és també membre aquest usuari.

source: Create the user's home directory if it does not exist. The files and directories contained in the skeleton directory (which can be defined with the -k option or in the config file) will be copied to the home directory.
ca_es: Crea el directori personal de l'usuari si no existeix. Al directori personal es copiaran els fitxers i directoris continguts en el directori esquelet (que es pot definir amb l'opció -k o en el fitxer de configuració).

source: Do not create the user's home directory. Overrides configuration settings.
ca_es: No crea el directori personal de l'usuari. Invalida els paràmetres de configuració.

source: <option>-k</option>,<option>--skel</option> <replaceable>SKELDIR</replaceable>
ca_es: <option>-k</option>,<option>--skel</option> <replaceable>DIRECTORI ESQUELET</replaceable>

source: Error starting Virtual Machine Manager
ca_es: S'ha produït un error en iniciar el Gestor de màquines virtuals

source: virt-manager requires libvirt 0.6.0 or later.
ca_es: virt-manager requereix libvirt 0.6.0 o superior.

source: An install method must be specified (%(methods)s)
ca_es: S'ha d'especificar un mètode d'instal·lació⏎ (%(methods)s)

source: --disk storage must be specified (override with --nodisks)
ca_es: S'ha d'especificar un emmagatzematge --disk (ho podeu evitar amb --nodisks)

source: Error in %(chartype)s device parameters: %(err)s
ca_es: S'ha produït un error en els paràmetres del dispositiu %(chartype)s: %(err)s

source: Error in watchdog device parameters: %s
ca_es: S'ha produït un error en els paràmetres del dispositiu de watchdog: %s

source: Error in filesystem device parameters: %s
ca_es: S'ha produït un error en els paràmetres del dispositiu del sistema de fitxers: %s

source: Error with storage parameters: %s
ca_es: S'ha produït un error amb els paràmetres d'emmagatzematge: %s

source: Would you like a fully virtualized guest (yes or no)? This will allow you to run unmodified operating systems.
ca_es: Voleu un hoste totalment virtualitzat (yes o no)? Això us permetrà l'execució de sistemes operatius sense modificar.

source: Would you like to use %s acceleration? (yes or no)
ca_es: Voleu utilitzar l'acceleració %s? (yes o no)

source: Can't do more than one of --hvm, --paravirt, or --container
ca_es: No es pot fer més d'un --hvm, --paravirt, o --container

source: Error validating install location: %s
ca_es: S'ha produït un error en validar la ubicació d'instal·lació: %s

source: What is the install CD-ROM/ISO or URL?
ca_es: Quin és el CD-ROM/ISO o l'URL d'instal·lació?

source: What is the install URL?
ca_es: Quin és l'URL d'instal·lació?

source: Cannot specify storage and use --nodisks
ca_es: No es pot especificar un emmagatzematge i utilitzar --nodisks

source: Cannot mix --file, --nonsparse, or --file-size with --disk options. Use --disk PATH[,size=SIZE][,sparse=yes|no]
ca_es: No es pot barrejar --file, --nonsparse, o --file-size amb les opcions de --disk. Useu --disk PATH[,size=SIZE][,sparse=yes|no]

source: Cannot use --mac with --nonetworks
ca_es: No es pot utilitzar --mac amb --nonetworks

source: Cannot use --bridge with --nonetworks
ca_es: No es pot utilitzar --bridge amb --nonetworks

source: Cannot use --network with --nonetworks
ca_es: No es pot utilitzar --network amb --nonetworks

source: Only one install method can be used (%(methods)s)
ca_es: Només es pot utilitzar un mètode d'instal·lació (%(methods)s)

source: Install methods (%s) cannot be specified for container guests
ca_es: No es poden especificar els mètodes d'instal·lació (%s) per als hostes de contenidors

source: Network PXE boot is not supported for paravirtualized guests
ca_es: L'arrencada PXE en xarxa no està suportada per a hostes paravirtualitzats

source: Paravirtualized guests cannot install off cdrom media.
ca_es: Els hostes paravirtualitzats no es poden instal·lar des d'un suport CD-ROM.

source: Libvirt version does not support remote --location installs
ca_es: La versió de libvirt no suporta instal·lacions remotes de tipus --location

source: --extra-args only work if specified with --location.
ca_es: --extra-args només funciona si s'especifica amb --location.

source: --initrd-inject only works if specified with --location.
ca_es: --initrd-inject només funciona si s'especifica amb --location.

source: Can't use --pxe with --nonetworks
ca_es: No es pot utilitzar --pxe amb --nonetworks

source: A disk device must be specified with --import.
ca_es: S'ha d'especificar un dispositiu de disc amb --import.

source: The guest's network configuration does not support PXE
ca_es: La configuració de xarxa de l'hoste no suporta PXE

source: Unable to connect to graphical console: virt-viewer not installed. Please install the 'virt-viewer' package.
ca_es: No s'ha pogut connectar a la consola gràfica: virt-viewer no està instal·lat. Si us plau instal·leu el paquet 'virt-viewer'.

source: Starting install...
ca_es: S'està iniciant la instal·lació...

source: Domain creation completed. You can restart your domain by running: %s
ca_es: Creació de domini completada. Podeu reiniciar el vostre domini executant:⏎ %s

source: Guest installation complete... restarting guest.
ca_es: Instal·lació de l'hoste completada... S'està reiniciant l'hoste.

source: Domain install interrupted.
ca_es: S'ha interromput la instal·lació del domini.

source: Domain has crashed.
ca_es: El domini ha fallat.

source: Domain installation still in progress. You can reconnect to the console to complete the installation process.
ca_es: La instal·lació del domini encara està en curs. Podeu connectar de nou⏎ amb la consola per completar el procés d'instal·lació.

source: %d minutes
ca_es: %d minuts

source: Domain installation still in progress. Waiting %sfor installation to complete.
ca_es: La instal·lació del domini encara està en curs. S'està esperant %s per completar la instal·lació.

source: Domain has shutdown. Continuing.
ca_es: S'ha aturat el domini. Continuant.

source: Could not lookup domain after install: %s
ca_es: No s'ha pogut cercar el domini després de la instal·lació: %s

source: Installation has exceeded specified time limit. Exiting application.
ca_es: La instal·lació ha superat el temps límit especificat. S'està sortint de l'aplicació.

source: Dry run completed successfully
ca_es: La prova d'assaig s'ha acabat amb èxit

source: --print-xml can only be used with guests that do not have an installation phase (--import, --boot, etc.). To see all generated XML, please use --print-step all.
ca_es: Només es pot utilitzar --print-xml amb els hostes que no tenen una fase d'instal·lació (--import, --boot, etc.). Per veure tot el XML generat, utilitzeu --print-step all.

source: Requested installation does not have XML step 2
ca_es: La instal·lació sol·licitada no té XML step 2

source: Requested installation does not have XML step 3
ca_es: La instal·lació sol·licitada no té XML step 3

source: Create a new virtual machine from specified install media.
ca_es: Crea una nova màquina virtual des del suport d'instal·lació.

source: General Options
ca_es: Opcions generals

source: Name of the guest instance
ca_es: Nom de la instància de l'hoste

source: Memory to allocate for guest instance in megabytes
ca_es: Memòria a assignar per a la instància de l'hoste, en megabytes

source: Human readable description of the VM to store in the generated XML.
ca_es: Descripció legible per humans de la MV on desar el XML generat.

source: Set domain security driver configuration.
ca_es: Estableix la configuració del controlador de seguretat del domini.

source: Tune NUMA policy for the domain process.
ca_es: Ajusta la política NUMA per al procés del domini.

source: Installation Method Options
ca_es: Opcions del mètode d'instal·lació

source: CD-ROM installation media
ca_es: Suport d'instal·lació CD-ROM

source: Installation source (eg, nfs:host:/path, http://host/path, ftp://host/path)
ca_es: Origen d'instal·lació (p. e., nfs:host:/path, http://host/path, ftp://host/path)

source: Boot from the network using the PXE protocol
ca_es: Arrenca des de la xarxa fent servir el protocol PXE

source: Build guest around an existing disk image
ca_es: Muntatge de l'hoste sobre una imatge de disc existent

source: Path to init binary for container guest. Ex: --init /path/to/app (to contain an application) --init /sbin/init (for a full OS container)
ca_es: Camí del binari d'inici per al contenidor de l'hoste. P. Ex.:⏎ --init /cami/a/app (que conté una aplicació)⏎ --init /sbin/init (per a un contenidor de sistema operatiu complet)

source: Treat the CD-ROM media as a Live CD
ca_es: Tracta el suport de CD-ROM com a un CD autònom

source: Additional arguments to pass to the install kernel booted from --location
ca_es: Arguments addicionals a passar al nucli d'instal·lació arrencat des de --location

source: Add given file to root of initrd from --location
ca_es: Afegeix el fitxer indicat a l'arrel d'initrd de --location

source: Optionally configure post-install boot order, menu, permanent kernel boot, etc.
ca_es: Opcionalment configura l'ordre d'arrencada del post-install, del menu, de l'arrencada de nucli permanent, etc.

source: Storage Configuration
ca_es: Configuració d'emmagatzematge

source: Specify storage with various options. Ex. --disk path=/my/existing/disk --disk path=/my/new/disk,size=5 (in gigabytes) --disk vol=poolname/volname,device=cdrom,bus=scsi,...
ca_es: Especifiqueu l'emmagatzematge amb diverses opcions. p. e.:⏎ --disk path=/my/existing/disk⏎ --disk path=/my/new/disk,size=5 (en gigabytes)⏎ --disk vol=poolname/volname,device=cdrom,bus=scsi,...⏎

source: Don't set up any disks for the guest.
ca_es: No configuris cap disc per a l'hoste.

source: Don't create network interfaces for the guest.
ca_es: No creïs interfícies de xarxa per a l'hoste.

source: Don't automatically try to connect to the guest console
ca_es: No intentis connectar automàticament amb la consola de l'hoste

source: Device Options
ca_es: Opcions de dispositiu

source: Virtualization Platform Options
ca_es: Opcions de plataforma de virtualització

source: This guest should be a fully virtualized guest
ca_es: Aquest hoste hauria de ser un hoste totalment virtualitzat

source: This guest should be a paravirtualized guest
ca_es: Aquest hoste hauria de ser un hoste paravirtualitzat

source: This guest should be a container guest
ca_es: Aquest hoste hauria de ser un hoste contenidor

source: Hypervisor name to use (kvm, qemu, xen, ...)
ca_es: Nom de l'hipervisor a utilitzar (kvm, qemu, xen, ...)

source: The CPU architecture to simulate
ca_es: L'arquitectura de CPU a simular

source: The machine type to emulate
ca_es: El tipus de màquina a emular

source: UUID for the guest.
ca_es: UUID per a l'hoste.

source: Miscellaneous Options
ca_es: Opcions de miscel·lània

source: Have domain autostart on host boot up.
ca_es: Permet l'autoinici del domini en l'arrencada de l'amfitrió

source: Print the generated domain XML rather than define the guest.
ca_es: Imprimeix el domini XML generat en lloc de definir l'hoste.

source: Print XML of a specific install step (1, 2, 3, all) rather than define the guest.
ca_es: Imprimeix el XML un determinat pas de la instal·lació (1, 2, 3, tots) en lloc de definir l'hoste.

source: Don't boot guest after completing install.
ca_es: No arrenquis l'hoste després de completar la instal·lació.

source: Time to wait (in minutes)
ca_es: Temps d'espera (en minuts)

source: Run through install process, but do not create devices or define the guest.
ca_es: Executa el procés d'instal·lació, però no creïs dispositius ni defineixis l'hoste.

source: Forces 'yes' for any applicable prompts, terminates for all others
ca_es: Força 'yes' per a qualsevol indicador rellevant i finalitza en qualsevol altre cas
